app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @user = User.find_by(id: session[:user])

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT 1  [["uid", 8129934], ["provider", "github"]]
---
  def create
    auth_hash = request.env['omniauth.auth']

    if !auth_hash['uid']
      redirect_to login_failure_path
    end

    @user = User.find_by(uid: auth_hash[:uid], provider: 'github')