app/controllers/tasks_controller.rb

  def index
    @tasks = @user.tasks.all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]