app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "tasks" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Go to grocery NOW"], ["description", "Carrots  tasty!\r\n  "], ["updated_at", "2016-09-29 22:23:35.098319"], ["id", 22]]
---
    task = Task.find(params[:id])

    if params[:patch]
      task.update(title: params[:patch][:title], description: params[:patch][:description])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @task = Task.find(params[:id].to_i)

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Do the laundry"], ["description", "Wash the laundry on delicate cold cycle. Line dry.  "], ["created_at", "2016-09-28 21:46:12.941832"], ["updated_at", "2016-09-28 21:46:12.941832"]]
---
  def create
    Task.create(title: params[:post][:title], description: params[:post][:description])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 20]]
---
  def edit
    @task = Task.find(params[:id].to_i)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    Task.find(params[:id]).destroy